{
  "architectures": [
    "TimesFmModelForPrediction"
  ],
  "context_length": 16384,
  "head_dim": 80,
  "hidden_size": 1280,
  "horizon_length": 128,
  "intermediate_size": 1280,
  "model_type": "timesfm",
  "num_attention_heads": 16,
  "num_hidden_layers": 20,
  "patch_length": 32,
  "quantile_horizon_length": 1024,
  "quantiles": [
    0.1,
    0.2,
    0.3,
    0.4,
    0.5,
    0.6,
    0.7,
    0.8,
    0.9
  ],
  "rms_norm_eps": 1e-06,
  "torch_compile": false
}